docs/_static/graphs/energy_mix_prod_conso.dot
digraph {
	"LIQUID-H2 production" -> "H2_liquefaction production" [label="H2_liquefaction.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"LIQUID-H2 consumption" -> "LIQUID-H2 production" [label="LIQUID-H2.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"LIQUID-H2 consumption" -> "GAS-H2 consumption" [label="LIQUID-H2.GAS-H2.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"LIQUID-H2 consumption" -> "Aggregate consumption" [label="LIQUID-H2.ELECTRICITY.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"GAS-H2 production" -> "Electrolysis production" [label="Electrolysis.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"GAS-H2 production" -> "Gas_reforming production" [label="Gas_reforming.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"GAS-H2 consumption" -> "GAS-H2 production" [label="GAS-H2.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"GAS-H2 consumption" -> "Aggregate consumption" [label="GAS-H2.ELECTRICITY.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"KEROSENE production" -> "Refinery production" [label="Refinery.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"KEROSENE consumption" -> "KEROSENE production" [label="KEROSENE.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"KEROSENE consumption" -> "Aggregate consumption" [label="KEROSENE.OIL.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"BIOFUEL production" -> "FT production" [label="FT.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"BIOFUEL production" -> "ATJ production" [label="ATJ.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"BIOFUEL production" -> "HEFA production" [label="HEFA.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"BIOFUEL consumption" -> "BIOFUEL production" [label="BIOFUEL.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"BIOFUEL consumption" -> "Aggregate consumption" [label="BIOFUEL.BIOMASS.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"BATTERY production" -> "Charging production" [label="Charging.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"BATTERY consumption" -> "BATTERY production" [label="BATTERY.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"BATTERY consumption" -> "Aggregate consumption" [label="BATTERY.ELECTRICITY.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"JET-A production" -> "Electrofuel production" [label="Electrofuel.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"JET-A production" -> "Biofuel production" [label="Biofuel.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"JET-A production" -> "Fossil production" [label="Fossil.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"JET-A consumption" -> "KEROSENE consumption" [label="JET-A.KEROSENE.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"JET-A consumption" -> "BIOFUEL consumption" [label="JET-A.BIOFUEL.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"JET-A consumption" -> "JET-A production" [label="JET-A.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"JET-A consumption" -> "E-FUEL consumption" [label="JET-A.E-FUEL.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"E-FUEL production" -> "Power_to_liquid production" [label="Power_to_liquid.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"E-FUEL consumption" -> "GAS-H2 consumption" [label="E-FUEL.GAS-H2.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"E-FUEL consumption" -> "E-FUEL production" [label="E-FUEL.production" color=black dir=forward fontcolor=black penwidth=1.0]
	"E-FUEL consumption" -> "Aggregate consumption" [label="E-FUEL.ELECTRICITY.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"H2_liquefaction production" -> "_H2_liquefaction production" [label="H2_liquefaction.ELECTRICITY.consumption,H2_liquefaction.GAS-H2.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_H2_liquefaction production" [style=invis]
	"Electrolysis production" -> "_Electrolysis production" [label="Electrolysis.ELECTRICITY.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Electrolysis production" [style=invis]
	"Refinery production" -> "_Refinery production" [label="Refinery.OIL.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Refinery production" [style=invis]
	"FT production" -> "_FT production" [label="FT.BIOMASS.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_FT production" [style=invis]
	"ATJ production" -> "_ATJ production" [label="ATJ.BIOMASS.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_ATJ production" [style=invis]
	"HEFA production" -> "_HEFA production" [label="HEFA.BIOMASS.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_HEFA production" [style=invis]
	"Charging production" -> "_Charging production" [label="Charging.ELECTRICITY.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Charging production" [style=invis]
	"Electrofuel production" -> "_Electrofuel production" [label="Electrofuel.E-FUEL.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Electrofuel production" [style=invis]
	"Biofuel production" -> "_Biofuel production" [label="Biofuel.BIOFUEL.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Biofuel production" [style=invis]
	"Fossil production" -> "_Fossil production" [label="Fossil.KEROSENE.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Fossil production" [style=invis]
	"Power_to_liquid production" -> "_Power_to_liquid production" [label="Power_to_liquid.ELECTRICITY.consumption,Power_to_liquid.GAS-H2.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Power_to_liquid production" [style=invis]
	"Aggregate consumption" -> "_Aggregate consumption" [label="BIOMASS.consumption,ELECTRICITY.consumption,OIL.consumption" color=black dir=forward fontcolor=black penwidth=1.0]
	"_Aggregate consumption" [style=invis]
}
